ctapang/v0_70b/framework/peripheral/sqi/processor/sqi_p32mx170f256c.h
INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TransferModeSet(SQI_MODULE_ID index, SQI_XFER_MODE mode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_XFER_MODE _PLIB_UNSUPPORTED PLIB_SQI_TransferModeGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_XFER_MODE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTransferModeControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ConfigWordSet(SQI_MODULE_ID index, bool sqiEnable, SQI_CS_OEN csPins, SQI_DATA_OEN dataPins, bool reset, bool burstEn, bool hold, bool writeProtect, bool rxLatch, SQI_DATA_FORMAT lsbf, SQI_DATA_MODE dataMode, SQI_XFER_MODE xferMode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_ConfigWordGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsConfigWord(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ChipSelectDeassertEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ChipSelectDeassertDisable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsCSDeassert(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ChipSelectSet(SQI_MODULE_ID index, SQI_CS_NUM csNum)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_CS_NUM _PLIB_UNSUPPORTED PLIB_SQI_ChipSelectGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_CS_NUM)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsChipSelect(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_LaneModeSet(SQI_MODULE_ID index, SQI_LANE_MODE mode)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_LANE_MODE _PLIB_UNSUPPORTED PLIB_SQI_LaneModeGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_LANE_MODE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsLaneMode(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TransferDirectionSet(SQI_MODULE_ID index, SQI_XFER_CMD command)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API SQI_XFER_CMD _PLIB_UNSUPPORTED PLIB_SQI_TransferDirectionGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_XFER_CMD)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTransferCommand(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ByteCountSet(SQI_MODULE_ID index, uint16_t xferCount)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_SQI_ByteCountGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTransferCount(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ControlWordSet(SQI_MODULE_ID index, bool csDeassert, SQI_CS_NUM csNum, SQI_LANE_MODE laneMode, SQI_XFER_CMD command, uint16_t xferCount)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_ControlWordGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsControlWord(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ClockDividerSet(SQI_MODULE_ID index, SQI_CLK_DIV clkDivider)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsClockDivider(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ClockIsStable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsClockReady(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ClockEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ClockDisable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsClockControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_RxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_RxBufferThresholdGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsRxBufThreshold(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TxBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

