ctapang/v0_70b/framework/peripheral/sqi/processor/sqi_p32mx170f256c.h
INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_TxBufferThresholdGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTxBufThreshold(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_RxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_RxBufferThresholdIntGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsRxBufIntThreshold(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TxBufferThresholdIntSet(SQI_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_TxBufferThresholdIntGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTxBufIntThreshold(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_InterruptEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_InterruptDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_InterruptIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsInterruptControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_InterruptFlagGet(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsInterruptStatus(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TransmitData(SQI_MODULE_ID index, uint32_t data)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTxData(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint32_t _PLIB_UNSUPPORTED PLIB_SQI_ReceiveData(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsRxData(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_TransmitBufferFreeSpaceGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTxBufferFree(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_NumberOfReceiveBufferReads(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsRxBufferCount(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DataLineStatus(SQI_MODULE_ID index, bool dataPin)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDataPinStatus(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ReceiveBufferIsUnderrun(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsRxUnderRun(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_TransmitBufferHasOverflowed(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsTxOverFlow(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMAEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMADisable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DMAIsEnabled(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

