ctapang/v0_70b/framework/peripheral/sqi/processor/sqi_p32mx170f256c.h
INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDmaEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMABDPollEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMABDPollDisable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DMABDPollIsEnabled(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDPollingEnable(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMABDFetchStart(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsStartDMA(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void* _PLIB_UNSUPPORTED PLIB_SQI_DMABDCurrentAddressGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDCurrentAddress(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMABDBaseAddressSet(SQI_MODULE_ID index, void* baseBDAddress)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void* _PLIB_UNSUPPORTED PLIB_SQI_DMABDBaseAddressGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDBaseAddress(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API SQI_BD_STATE _PLIB_UNSUPPORTED PLIB_SQI_DMABDStateGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_BD_STATE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDProcessState(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DMAHasStarted(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDMAProcessInProgress(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DMABDIsBusy(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsDMAEngineBusy(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_SQI_DMABDControlWordGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDControlWord(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DMABDPollCounterSet(SQI_MODULE_ID index, uint16_t pollCount)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDPollCount(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API SQI_BD_STATE _PLIB_UNSUPPORTED PLIB_SQI_DMABDTransmitStateGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_BD_STATE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDTxState(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_DMABDTransmitBufferCountGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDTxBufCount(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_DMABDTransmitBufferLengthGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDTxLength(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API SQI_BD_STATE _PLIB_UNSUPPORTED PLIB_SQI_DMABDReceiveStateGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (SQI_BD_STATE)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDRxState(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_DMABDReceiveBufferCountGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDRxBufCount(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_DMABDReceiveBufferLengthGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsBDRxLength(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_ControlBufferThresholdSet(SQI_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_SQI_ControlBufferThresholdGet(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsConBufThreshold(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_InterruptSignalEnable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_InterruptSignalDisable(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            break;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_InterruptSignalIsEnabled(SQI_MODULE_ID index, SQI_INTERRUPTS interruptFlag)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_ExistsInterruptSignalControl(SQI_MODULE_ID index)
{
    switch (index) {
        case SQI_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
